new/app/controllers/patient_alerts_controller.rb

  def index
    @patient_alerts = PatientAlerts.all
---
SELECT * FROM "patient_alerts"