new/app/controllers/patients_controller.rb

SELECT * FROM "patients"
---
  def index
    @patients = Patient.all

SELECT * FROM "patients" WHERE ("patients"."id" = 1)
---
  def show
    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("city", "mother_first_name", "dob", "zip", "photo_file_size", "updated_at", "medical_record_number", "mother_last_name", "emergency_contact_relation", "photo_file_url", "emergency_contact_number", "gender", "notes", "father_last_name", "emergency_contact_name", "photo_content_type", "father_first_name", "first_name", "telephone", "last_name", "arrival_date", "address", "middle_name", "state", "created_at") VALUES('asdf', 'asdf', '2009-11-13 23:00:00', 'asdf', NULL, '2009-11-13 23:01:03', '12345', 'asdf', 'asdf', '', 'asdf', 'bl', '', 'asdf', 'asdf', '', 'asdf', 'blah', 'asdf', 'blah', '2009-11-13 23:00:00', 'asdf', 'blah', 'asdf', '2009-11-13 23:01:03')
---
  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save