new/app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    user.activate!

    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "activated_at", "crypted_password", "remember_token_expires_at", "activation_code", "remember_token", "login", "email", "created_at") VALUES('', '4aa7e43b85d93b7a13df1c1c85859fc43ef4b44f', '2009-11-13 22:50:54', NULL, '10b4b4f88549f0f60bad6c8957337cdb82e9d6d0', NULL, '4ce8bc226ba0c5ccbb18731dc8454d29077353e5', NULL, 'admin', 'admin@gmail.com', '2009-11-13 22:50:54')