app/controllers/allergies_controller.rb

  def index

    @user = User.find_by_id(cookies[:userID])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1