app/controllers/medications_controller.rb

  def index

     @user = User.find_by_id(cookies[:userID])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1