app/controllers/patient_allergies_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "patient_allergies" WHERE ("patient_allergies".patient_id = 1)
SELECT * FROM "patients" WHERE ("patients"."id" = 1)
---
  def index

    @user = User.find_by_id(cookies[:userID])
    #get master key using cookieSalt and password
    @password = EzCrypto::Key.decrypt_with_password @user.cookieSalt, "system salt",cookies[:encryptedPassword]
    @masterKey = EzCrypto::Key.decrypt_with_password @password, "system salt",@user.encryptedKey

  	if (params[:patient_id])
    	@patient_allergies = @patient.patient_allergies
      for @patient_allergy in @patient_allergies
        @patient_allergy.enter_password @masterKey
      end

    	@patient_allergies.sort! {|y, x| x.date_observed <=> y.date_observed}
    else
    	@patient_allergies = PatientAllergy.find(:all, :order => "date_observed DESC")