app/controllers/patient_physicals_controller.rb

  def height
    @visits = @patient.patient_visits.select {|v| v.height != ""}
---
SELECT * FROM "patient_visits" WHERE ("patient_visits".patient_id = 1)

  def weight
    @visits = @patient.patient_visits.select {|v| v.weight != ""}
---
SELECT * FROM "patient_visits" WHERE ("patient_visits".patient_id = 1)

  def blood_pressure
    @visits = @patient.patient_visits.select {|v| v.blood_pressure != ""}
---
SELECT * FROM "patient_visits" WHERE ("patient_visits".patient_id = 1)

  def pulse
    @visits = @patient.patient_visits.select {|v| v.pulse != ""}
---
SELECT * FROM "patient_visits" WHERE ("patient_visits".patient_id = 1)

  def temperature
    @visits = @patient.patient_visits.select {|v| v.temperature != ""}
---
SELECT * FROM "patient_visits" WHERE ("patient_visits".patient_id = 1)