app/controllers/patient_visits_controller.rb

  def index
	@user = User.find_by_id(cookies[:userID])
	#get master key using cookieSalt and password
	@password = EzCrypto::Key.decrypt_with_password @user.cookieSalt, "system salt",cookies[:encryptedPassword]
	@masterKey = EzCrypto::Key.decrypt_with_password @password, "system salt",@user.encryptedKey
  	if params[:patient_id]

  		@patient_visits = @patient.patient_visits
		for @patient_visit in @patient_visits
			if @patient_visit !=nil
				@patient_visit.enter_password @masterKey
			end
		end
    	@patient_visits.sort! {|y, x| x.visit_date <=> y.visit_date}
  	else
  		@patient_visits = PatientVisit.find(:all, :order => "visit_date DESC")
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "patient_visits" WHERE ("patient_visits".patient_id = 1)
SELECT * FROM "patients" WHERE ("patients"."id" = 1)