app/controllers/patient_vaccinations_controller.rb

  def index

    @user = User.find_by_id(cookies[:userID])
    #get master key using cookieSalt and password
    @password = EzCrypto::Key.decrypt_with_password @user.cookieSalt, "system salt",cookies[:encryptedPassword]
    @masterKey = EzCrypto::Key.decrypt_with_password @password, "system salt",@user.encryptedKey

  	if params[:patient_id]
    	@patient_vaccinations = @patient.patient_vaccinations
      for @patient_vaccination in @patient_vaccinations
         @patient_vaccination.enter_password @masterKey
      end

    	@patient_vaccinations.sort! {|y, x| x.date_admined <=> y.date_admined}
   	else
   		@patient_vaccinations = PatientVaccination.find(:all, :order => "date_admined DESC")
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "patient_vaccinations" WHERE ("patient_vaccinations".patient_id = 1)
SELECT * FROM "patients" WHERE ("patients"."id" = 1)