app/controllers/patient_alerts_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "patient_alerts" WHERE ("patient_alerts".patient_id = 1)
SELECT * FROM "patients" WHERE ("patients"."id" = 1)
---
  def index
  		@user = User.find_by_id(cookies[:userID])
		#get master key using cookieSalt and password
		@password = EzCrypto::Key.decrypt_with_password @user.cookieSalt, "system salt",cookies[:encryptedPassword]
		@masterKey = EzCrypto::Key.decrypt_with_password @password, "system salt",@user.encryptedKey

		#@patient_alerts = PatientAlert.find(:all)
		#for @patient_alert in @patient_alerts
			#@patient_alert.enter_password @masterKey
		#end
    if params[:patient_id]
      @patient_alerts = @patient.patient_alerts
      for @patient_alert in @patient_alerts
        @patient_alert.enter_password @masterKey
      end

    	@patient_alerts.sort! {|x, y| x.alert_date <=> y.alert_date}
    else
    	@patient_alerts = PatientAlert.find(:all, :order => "alert_date")