app/controllers/patient_medications_controller.rb

  def index

    @user = User.find_by_id(cookies[:userID])
    #get master key using cookieSalt and password
    @password = EzCrypto::Key.decrypt_with_password @user.cookieSalt, "system salt",cookies[:encryptedPassword]
    @masterKey = EzCrypto::Key.decrypt_with_password @password, "system salt",@user.encryptedKey

  	if (params[:patient_id])
    	@patient_medications = @patient.patient_medications
      for @patient_medication in @patient_medications
        @patient_medication.enter_password @masterKey
      end

    	@patient_medications.sort! {|y, x| x.date_given <=> y.date_given}
    else
    	@patient_medications = PatientMedication.find(:all, :order => "date_given DESC")
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "patient_medications" WHERE ("patient_medications".patient_id = 1)
SELECT * FROM "patients" WHERE ("patients"."id" = 1)