app/controllers/patient_notes_controller.rb

  def index
	@user = User.find_by_id(cookies[:userID])
	#get master key using cookieSalt and password
	@password = EzCrypto::Key.decrypt_with_password @user.cookieSalt, "system salt",cookies[:encryptedPassword]
	@masterKey = EzCrypto::Key.decrypt_with_password @password, "system salt",@user.encryptedKey
	#@patient = Patient.find(params[:id])
	if (params[:patient_id])
		@patient_notes=@patient.patient_notes
	else
		@patient_notes = PatientNote.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "patient_notes" WHERE ("patient_notes".patient_id = 1)
SELECT * FROM "patients" WHERE ("patients"."id" = 1)