app/controllers/patients_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @patients = Patient.find(:all)
	#get user's id from cookie and look up user in the db
    @user = User.find_by_id(cookies[:userID])

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def create
#create a new patient object from information submitted through new patient form
    APP_LOGGER_LOG.info "In Create in Patient Controller Patient - " + params[:patient].to_s
    @patientNew = Patient.new(params[:patient])

    #get user's id from cookie and look up user in the db
    @user = User.find_by_id(cookies[:userID])

INSERT INTO "patients" ("city", "mother_first_name", "zip", "photo_file_name", "photo_file_size", "updated_at", "medical_record_number", "mother_last_name", "emergency_contact_number", "gender", "emergency_contact_relationship", "notes", "father_last_name", "emergency_contact_name", "photo_content_type", "father_first_name", "first_name", "date_of_birth", "telephone", "last_name", "arrival_date", "address", "middle_name", "state", "created_at") VALUES('Deug bi', 'Astou', '123', NULL, NULL, '2010-06-09 17:24:17', '123456789', 'Keinde', '233412231', 'Male', 'Bro', 'Checking the system', 'Diop', 'Dame Diop', NULL, 'Mbaye', 'Makhary', '1990-01-17', '1223343', 'Diop', '2010-06-09', 'Keur Serigne Bi', 'Dff', 'Gokh bi', '2010-06-09 17:24:17')
---


    respond_to do |format|
      if @patient.save