app/controllers/sessions_controller.rb

  def create
    self.current_user = User.authenticate(params[:login], params[:password])
    if logged_in?
      if params[:remember_me] == "1"
        current_user.remember_me unless current_user.remember_token?
        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
      end

	#@user = User.find_by_login(params[:login])
	#@masterKey = EzCrypto::Key.decrypt_with_password params[:password], "system salt", @user.encryptedKey
	#@masterKey = EzCrypto::Key.decode @masterKey
	#@user.enter_password @masterKey

	@cookieSalt = EzCrypto::Key.generate
	@cookieSalt = @cookieSalt.to_s
	@encryptedPassword=EzCrypto::Key.encrypt_with_password @cookieSalt, "system salt", params[:password]
	@user = User.find_by_login(params[:login])
	#current_user.cookieSalt = "blah"  #@cookieSalt
	  #cookies[:login]=params[:login]
      cookies[:userID] = @user.id.to_s
	@user.cookieSalt = @cookieSalt
	@user.save!
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."login") = 'admin' AND "users".id <> 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-04 01:49:04', "cookieSalt" = 'dummy' WHERE "id" = 2