app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"