app/controllers/vaccinations_controller.rb

  def index

    @user = User.find_by_id(cookies[:userID])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def show
    @vaccination = Vaccination.find(params[:id])
---
SELECT * FROM "vaccinations" WHERE ("vaccinations"."id" = 0)