app/controllers/visit_types_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
	@user = User.find_by_id(cookies[:userID])